Catalogs/ФормулыРасчетаДатыПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФормулыРасчетаДатыПлатежа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтДатыОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФормулыРасчетаДатыПлатежа/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Справочник.Ссылка
	|ИЗ
	|	Справочник.ФормулыРасчетаДатыПлатежа КАК Справочник
	|ГДЕ
	|	Справочник.Наименование = &Наименование
	|	И Справочник.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Уже существует формула с наименованием %1.'"),Наименование),,,,Отказ);
	КонецЕсли;
	
	Если СтрНайти(Формула, "ДатаОтгрузки") > 0
		Или СтрНайти(Формула, "ДатаПоступления") > 0
		Или СтрНайти(Формула, "ДатаПереходаПраваСобственности") > 0 Тогда
		ЗависитОтДатыОтгрузки = Истина;
	Иначе
		ЗависитОтДатыОтгрузки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
